In [7]:
import pandas as pd

In [33]:
#csv path
csv_file_path = '../Downloads/business-financial-data-june-2024-quarter-csv.csv'

In [35]:
#reading csv file
df = pd.read_csv(csv_file_path)

In [147]:
df.columns # columns of the dataframe

Index(['Series_reference', 'Period', 'Data_value', 'Suppressed', 'STATUS',
       'UNITS', 'Magnitude', 'Subject', 'Group', 'Series_title_1',
       'Series_title_2', 'Series_title_3', 'Series_title_4', 'Series_title_5'],
      dtype='object')

In [149]:
df.head() # to print first 5 rows of the dataframe

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SF1AA2CA,2016.06,1116.386,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
1,BDCQ.SF1AA2CA,2016.09,1070.874,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
2,BDCQ.SF1AA2CA,2016.12,1054.408,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
3,BDCQ.SF1AA2CA,2017.03,1010.665,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN
4,BDCQ.SF1AA2CA,2017.06,1233.700,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted,NaN

In [151]:
df.tail() # to print last 5 rows of the dataframe

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
7870,BDCQ.SF8RSCA,2023.06,617.507,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
7871,BDCQ.SF8RSCA,2023.09,673.068,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
7872,BDCQ.SF8RSCA,2023.12,511.098,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
7873,BDCQ.SF8RSCA,2024.03,631.229,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
7874,BDCQ.SF8RSCA,2024.06,542.409,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN

In [153]:
df.info() #information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  7875 non-null   object
 1   Period            7875 non-null   float64
 2   Data_value        7138 non-null   float64
 3   Suppressed        15 non-null     object
 4   STATUS            7875 non-null   object
 5   UNITS             7875 non-null   object
 6   Magnitude         7875 non-null   int64
 7   Subject           7875 non-null   object
 8   Group             7875 non-null   object
 9   Series_title_1    7875 non-null   object
 10  Series_title_2    7875 non-null   object
 11  Series_title_3    7875 non-null   object
 12  Series_title_4    7875 non-null   object
 13  Series_title_5    0 non-null      float64
dtypes: float64(3), int64(1), object(10)
memory usage: 861.5+ KB

In [155]:
df.isnull().sum() #check for missing values

Series_reference       0
Period                 0
Data_value           737
Suppressed          7860
STATUS                 0
UNITS                  0
Magnitude              0
Subject                0
Group                  0
Series_title_1         0
Series_title_2         0
Series_title_3         0
Series_title_4         0
Series_title_5      7875
dtype: int64

In [157]:
df.describe()  #summary statistics of numeric columns

            Period    Data_value  Magnitude  Series_title_5
count  7875.000000   7138.000000     7875.0             0.0
mean   2019.973227   5011.224602        6.0             NaN
std       2.396220   7466.181578        0.0             NaN
min    2016.060000   -398.194000        6.0             NaN
25%    2018.060000    660.563000        6.0             NaN
50%    2020.060000   2137.997000        6.0             NaN
75%    2022.060000   4716.838000        6.0             NaN
max    2024.060000  41541.633000        6.0             NaN

In [159]:
df.duplicated().sum()  # check for duplicated values

0

In [161]:
#removing "Suppressed" and "Series_title_5" columns as most of it's values are empty
new_df_1 = df.drop('Suppressed', axis=1)
new_df_2 = new_df_1.drop('Series_title_5', axis=1)

In [163]:
new_df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  7875 non-null   object
 1   Period            7875 non-null   float64
 2   Data_value        7138 non-null   float64
 3   STATUS            7875 non-null   object
 4   UNITS             7875 non-null   object
 5   Magnitude         7875 non-null   int64
 6   Subject           7875 non-null   object
 7   Group             7875 non-null   object
 8   Series_title_1    7875 non-null   object
 9   Series_title_2    7875 non-null   object
 10  Series_title_3    7875 non-null   object
 11  Series_title_4    7875 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 738.4+ KB

In [165]:
new_df_2.columns

Index(['Series_reference', 'Period', 'Data_value', 'STATUS', 'UNITS',
       'Magnitude', 'Subject', 'Group', 'Series_title_1', 'Series_title_2',
       'Series_title_3', 'Series_title_4'],
      dtype='object')

In [167]:
new_df_2.duplicated().sum()

0

In [169]:
new_df_2.isnull().sum()

Series_reference      0
Period                0
Data_value          737
STATUS                0
UNITS                 0
Magnitude             0
Subject               0
Group                 0
Series_title_1        0
Series_title_2        0
Series_title_3        0
Series_title_4        0
dtype: int64

In [201]:
df_fill_with_mean = new_df_2
df_fill_with_mode = new_df_2
df_fill_with_median = new_df_2

In [203]:
df_fill_with_mean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  7875 non-null   object
 1   Period            7875 non-null   float64
 2   Data_value        7875 non-null   float64
 3   STATUS            7875 non-null   object
 4   UNITS             7875 non-null   object
 5   Magnitude         7875 non-null   int64
 6   Subject           7875 non-null   object
 7   Group             7875 non-null   object
 8   Series_title_1    7875 non-null   object
 9   Series_title_2    7875 non-null   object
 10  Series_title_3    7875 non-null   object
 11  Series_title_4    7875 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 738.4+ KB

In [205]:
#filling the empty values with mean value
mean_of_Data_value_column = df_fill_with_mean["Data_value"].mean()
df_fill_with_mean["Data_value"] = df_fill_with_mean["Data_value"].fillna(mean_of_Data_value_column)

#filling the empty values with mode value
mode_of_Data_value_column = df_fill_with_mode["Data_value"].mode()[0]
df_fill_with_mode["Data_value"] = df_fill_with_mode["Data_value"].fillna(mode_of_Data_value_column)

#filling the empty values with median value
median_of_Data_value_column = df_fill_with_median["Data_value"].median()
df_fill_with_median["Data_value"] = df_fill_with_median["Data_value"].fillna(median_of_Data_value_column)

In [250]:
print(mean_of_Data_value_column, mode_of_Data_value_column, median_of_Data_value_column)

5011.224601989353 5011.224601989354 2513.14

In [219]:
df_fill_with_mean.isnull().sum()

Series_reference    0
Period              0
Data_value          0
STATUS              0
UNITS               0
Magnitude           0
Subject             0
Group               0
Series_title_1      0
Series_title_2      0
Series_title_3      0
Series_title_4      0
dtype: int64

In [221]:
df_fill_with_mean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  7875 non-null   object
 1   Period            7875 non-null   float64
 2   Data_value        7875 non-null   float64
 3   STATUS            7875 non-null   object
 4   UNITS             7875 non-null   object
 5   Magnitude         7875 non-null   int64
 6   Subject           7875 non-null   object
 7   Group             7875 non-null   object
 8   Series_title_1    7875 non-null   object
 9   Series_title_2    7875 non-null   object
 10  Series_title_3    7875 non-null   object
 11  Series_title_4    7875 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 738.4+ KB

In [225]:
df_fill_with_mean.describe()

            Period    Data_value  Magnitude
count  7875.000000   7875.000000     7875.0
mean   2019.973227   5011.224602        6.0
std       2.396220   7108.184486        0.0
min    2016.060000   -398.194000        6.0
25%    2018.060000    745.061500        6.0
50%    2020.060000   2513.140000        6.0
75%    2022.060000   5011.224602        6.0
max    2024.060000  41541.633000        6.0

In [227]:
df_fill_with_mode.isnull().sum()

Series_reference    0
Period              0
Data_value          0
STATUS              0
UNITS               0
Magnitude           0
Subject             0
Group               0
Series_title_1      0
Series_title_2      0
Series_title_3      0
Series_title_4      0
dtype: int64

In [230]:
df_fill_with_mode.describe()

            Period    Data_value  Magnitude
count  7875.000000   7875.000000     7875.0
mean   2019.973227   5011.224602        6.0
std       2.396220   7108.184486        0.0
min    2016.060000   -398.194000        6.0
25%    2018.060000    745.061500        6.0
50%    2020.060000   2513.140000        6.0
75%    2022.060000   5011.224602        6.0
max    2024.060000  41541.633000        6.0

In [234]:
df_fill_with_mode.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  7875 non-null   object
 1   Period            7875 non-null   float64
 2   Data_value        7875 non-null   float64
 3   STATUS            7875 non-null   object
 4   UNITS             7875 non-null   object
 5   Magnitude         7875 non-null   int64
 6   Subject           7875 non-null   object
 7   Group             7875 non-null   object
 8   Series_title_1    7875 non-null   object
 9   Series_title_2    7875 non-null   object
 10  Series_title_3    7875 non-null   object
 11  Series_title_4    7875 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 738.4+ KB

In [238]:
df_fill_with_median.isnull().sum()

Series_reference    0
Period              0
Data_value          0
STATUS              0
UNITS               0
Magnitude           0
Subject             0
Group               0
Series_title_1      0
Series_title_2      0
Series_title_3      0
Series_title_4      0
dtype: int64

In [240]:
df_fill_with_median.describe()

            Period    Data_value  Magnitude
count  7875.000000   7875.000000     7875.0
mean   2019.973227   5011.224602        6.0
std       2.396220   7108.184486        0.0
min    2016.060000   -398.194000        6.0
25%    2018.060000    745.061500        6.0
50%    2020.060000   2513.140000        6.0
75%    2022.060000   5011.224602        6.0
max    2024.060000  41541.633000        6.0

In [242]:
df_fill_with_median.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7875 entries, 0 to 7874
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  7875 non-null   object
 1   Period            7875 non-null   float64
 2   Data_value        7875 non-null   float64
 3   STATUS            7875 non-null   object
 4   UNITS             7875 non-null   object
 5   Magnitude         7875 non-null   int64
 6   Subject           7875 non-null   object
 7   Group             7875 non-null   object
 8   Series_title_1    7875 non-null   object
 9   Series_title_2    7875 non-null   object
 10  Series_title_3    7875 non-null   object
 11  Series_title_4    7875 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 738.4+ KB

In [248]:
df_fill_with_mean["Data_value"]

0       1116.386
1       1070.874
2       1054.408
3       1010.665
4       1233.700
          ...
7870     617.507
7871     673.068
7872     511.098
7873     631.229
7874     542.409
Name: Data_value, Length: 7875, dtype: float64

In [252]:
new_mean_of_Data_value_column = df_fill_with_mean["Data_value"].mean()
new_mode_of_Data_value_column = df_fill_with_mode["Data_value"].mode()[0]
new_median_of_Data_value_column = df_fill_with_median["Data_value"].median()

In [256]:
print(new_mean_of_Data_value_column, new_mode_of_Data_value_column, new_median_of_Data_value_column)

5011.224601989353 5011.224601989354 2513.14